app/views/movies/show.html.erb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."movie_id" = ?  [["movie_id", 1]]
---
<h2>Reviews</h2>
<% @movie.reviews.each do |review| %>