app/controllers/reviews_controller.rb

  def index
    # For URL like /movies/1/reviews
    # Get the movie with id=1
    @movie = Movie.find(params[:movie_id])
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]

  def show
    @movie = Movie.find(params[:movie_id])

    # For URL like /movies/1/reviews/2
    # Find an review in movies 1 that has id=2
    @review = @movie.reviews.find(params[:id])
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."movie_id" = ? AND "reviews"."id" = ? LIMIT 1  [["movie_id", 1], ["id", 1]]

  def new
    @movie = Movie.find(params[:movie_id])
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]

  def create
    @movie = Movie.find(params[:movie_id])

    # For URL like /movies/1/reviews
    # Populate an review associate with movie 1 with form data
    # Movie will be associated with the review
    # @review = @movie.reviews.build(params.require(:review).permit!)
    @review = @movie.reviews.build(params.require(:review).permit(:details))
    if @review.save
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "reviews" ("details", "movie_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["details", "Good movie, would watch again"], ["movie_id", 1], ["created_at", "2019-03-18 13:59:10.341275"], ["updated_at", "2019-03-18 13:59:10.341275"]]

  def edit
    @movie = Movie.find(params[:movie_id])

    # For URL like /movies/1/reviews/2/edit
    # Get review id=2 for movie 1
    @review = @movie.reviews.find(params[:id])
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."movie_id" = ? AND "reviews"."id" = ? LIMIT 1  [["movie_id", 1], ["id", 1]]

  def update
    @movie = Movie.find(params[:movie_id])
    @review = Review.find(params[:id])
    if @review.update_attributes(params.require(:review).permit(:details))
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "reviews" SET "details" = ?, "updated_at" = ? WHERE "reviews"."id" = ?  [["details", "Good movie! Would watch again"], ["updated_at", "2019-03-18 14:02:53.038415"], ["id", 1]]

  def destroy
    @movie = Movie.find(params[:movie_id])
    @review = Review.find(params[:id])
    @review.destroy
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "reviews" WHERE "reviews"."id" = ?  [["id", 1]]